## 1. 공공데이터의 이해
1) 공공데이터는 공공기관이 직접 생성해서 관리하는 데이터만 해당한다. (x)
  - 취득하여 관리하는 데이터도 포함 한다.
2)공익목적으로 사용할 수 있는 데이터는 공공데이터가 유일하다.(X)
 - 민간데이터도 공익목적으로 사용가능하며, 공익목적의 활용을 염두에 둔 데이터는 민간 공공 구분없이 공익데이터라고 불리고 있다.
3)우리나라는 지금도 공공데이터 개방 수준이 후진국 수준으로 매우 뒤쳐져 있다는 평가를 받고 있다.



##  2. 데이터 기초 
1. 컴퓨터와 데이터 

1) 컴퓨터에서 2진수 1개를 저장하는 가장 기본단위로 0또는 1을 저장할 수 있는 가장 간단한 메모리 구조를 비트 라고 한다. (O)
 - 4바이트 = 32비트 
2) 컴퓨터에서 8자리 2진수 1개를 저장하기 위해서, 비트 8개를 묶은 것을 워드(word)라고 하고 1개의 워드에는 보통 2개의 문자를 저장할 수 있다.(X)
  - 비트 8개를 묶은 것을 바이트(byte)라고  하며, 보통 문자 1개를 저장할 수 있다.
3)컴퓨터 시스템을 구성하는 4대 요소  --> 하드웨어, 소프트웨어, 데이터, 사용자 이다.
4)데이터베이스에 저장된 데이터의 논리 구조 사양은 일종의 설계도 형태이고, 이것을 스키마(schema)라고 한다 (O)
5)데이터베이스에서 데이터를 검색하도록 요청하는 것을 데이터베이스 쿼리라고 한다.(O)
 - 데이터베이스 쿼리는 일종의 질문 방법으로, 데이터를 검색하도록 요청하는 것이다.
6)웹 브라우저에서 보내달라고 요청한 웹페이지를 보내주는 컴퓨터를 "HTML"이라고 한다. (X)
 - 웹브라우저에서 보내달라고 요청한 웹페이지를 보내주는 컴퓨터는 "웹서버"라고 한다.

